Documents/бит_ЗаявкаНаВыполнениеРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ЗаявкаНаВыполнениеРабот</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_РасходМатериаловПоВыполненнымРаботам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУдобноеДляЗаказчика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяФактическогоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КатегорииРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийПоВыполнению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный (диспетчер)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаВыполнение</Name>
					<Comment>Ответственный за выполнение (мастер)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценкаВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ОценкиВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Просрочена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияТоваровУслуг</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВыполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребованиеНакладная</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТребованиеНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентНормы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_НормыТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НарядЗаказ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_КоэффициентыНорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_КоэффициентыНорм</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Норма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НормыТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ЦеныРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЦеныРабот</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Норма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НормыТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидыОбъектовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Здание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицевойСчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_ЗаявкаНаВыполнениеРабот/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции

// Формирует текст про требование-накладную для показа в форме документа
//
// Параметры: 
//  Нет
//
// Возвращаемое значение:
//  Текстовая строка про требование-накладную.
//
&НаСервере
Функция ПолучитьТекстТребованияНакладной()
	
	Если ЗначениеЗаполнено(Объект.ТребованиеНакладная) Тогда
		
		Возврат Строка(Объект.ТребованиеНакладная)+ ?(Объект.ТребованиеНакладная.ПометкаУдаления, "; помечен на удаление", "");
		
	Иначе
		
		Возврат "Ввести требование-накладную";
		
	КонецЕсли;
	
КонецФункции

// Формирует текст про РеализациюТоваровУслуг для показа в форме документа
//
// Параметры: 
//  Нет
//
// Возвращаемое значение:
//  Текстовая строка про требование-накладную.
//
&НаСервере
Функция ПолучитьТекстРеализацииТоваровУслуг()
	
	Если ЗначениеЗаполнено(Объект.РеализацияТоваровУслуг) Тогда
		
		Возврат Строка(Объект.РеализацияТоваровУслуг)+ ?(Объект.РеализацияТоваровУслуг.ПометкаУдаления, "; помечен на удаление", "");
		
	Иначе
		
		Возврат "Ввести реализацию товаров и услуг";
		
	КонецЕсли;
	
КонецФункции

// Процедура рассчитывает поля табличной части "Работы".
&НаКлиенте
Процедура РассчитатьСтрокуТабЧастиРаботы(СтрокаТабЧастиРаботы)
	
	СтрокаТабЧастиРаботы.СуммаПлан	 = СтрокаТабЧастиРаботы.КоличествоПлан * СтрокаТабЧастиРаботы.ЦенаРаботы; 
	СтрокаТабЧастиРаботы.СуммаРаботы = СтрокаТабЧастиРаботы.Количество     * СтрокаТабЧастиРаботы.ЦенаРаботы; 
	
КонецПроцедуры

// Процедура рассчитывает поля табличной части "НарядЗаказ".
&НаКлиенте
Процедура РассчитатьСтрокуТабЧастиНарядЗаказ(СтрокаТабЧасти)
	
	// Рассчитать реквизиты табличной части.
	СтрокаТабЧасти.Сумма = СтрокаТабЧасти.Цена * ?(СтрокаТабЧасти.Количество = 0, 0, СтрокаТабЧасти.Количество);
	
	СтрокаТабЧасти.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(СтрокаТабЧасти.Сумма,
	Объект.УчитыватьНДС, 
	Объект.СуммаВключаетНДС,
	УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТабЧасти.СтавкаНДС));
	
	СтрокаТабЧасти.СуммаПлан = СтрокаТабЧасти.Цена * ?(СтрокаТабЧасти.КоличествоПлан = 0, 0, СтрокаТабЧасти.КоличествоПлан);
	
КонецПроцедуры

// Процедура получает значение поля ввода "ОбъемПлан" табличной части "Работы".
&НаСервереБезКонтекста
Функция ПолучитьОбъемРаботы(Знач Дата, Знач Подразделение, Знач ВидОбъекта, Знач Работа, Знач ЕдиницаИзмерения, Знач Норма)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_КоэффициентыНормСрезПоследних.Коэффициент
	|ИЗ
	|	РегистрСведений.бит_КоэффициентыНорм.СрезПоследних(
	|			&Период,
	|			Подразделение = &Подразделение
	|				И ВидОбъекта = &ВидОбъекта
	|				И Работа = &Работа
	|				И ЕдиницаИзмерения = &ЕдиницаИзмерения
	|				И Норма = &Норма) КАК бит_КоэффициентыНормСрезПоследних";
	
	Запрос.УстановитьПараметр("Период"	  	     , Дата);
	Запрос.УстановитьПараметр("Подразделение"	 , Подразделение);
	Запрос.УстановитьПараметр("ВидОбъекта"		 , ВидОбъекта);
	Запрос.УстановитьПараметр("Работа"   		 , Работа);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения" , ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Норма"			 , Норма);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Коэффициент;
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли; 
	
КонецФункции

// Процедура получает значение поля ввода "Цена" табличной части "Работы".
&НаСервереБезКонтекста
Функция ПолучитьЦенуРаботы(Знач Дата, Знач ВалютаДокумента, Знач Подразделение, Знач ВидОбъекта, Знач Работа, Знач ЕдиницаИзмерения, Знач Норма)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ЦеныРаботСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.бит_ЦеныРабот.СрезПоследних(
	|			&Период,
	|			Подразделение = &Подразделение
	|				И ВидОбъекта = &ВидОбъекта
	|				И Работа = &Работа
	|				И ЕдиницаИзмерения = &ЕдиницаИзмерения
	|				И Норма = &Норма
	|				И Валюта = &Валюта) КАК бит_ЦеныРаботСрезПоследних";
	
	Запрос.УстановитьПараметр("Период"		     , Дата);
	Запрос.УстановитьПараметр("Валюта"			 , ВалютаДокумента);
	Запрос.УстановитьПараметр("Подразделение"	 , Подразделение);
	Запрос.УстановитьПараметр("ВидОбъекта"		 , ВидОбъекта);
	Запрос.УстановитьПараметр("Работа"   		 , Работа);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения" , ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Норма"			 , Норма);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Цена;
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли; 
	
КонецФункции

#КонецОбласти

#Область УправлениеВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ВыписатьРеализацию.Заголовок = ПолучитьТекстРеализацииТоваровУслуг();
	Элементы.ВыписатьСписание.Заголовок = ПолучитьТекстТребованияНакладной();
	
	Если ЗначениеЗаполнено(Объект.ВидОбъекта) Тогда
		
		Элементы.ОбъектУчета.Доступность = Истина;
		
		Если Объект.ВидОбъекта = Перечисления.бит_ВидыОбъектовУчета.Здание Тогда
			
			Элементы.ОбъектУчета.Заголовок 		= "Здание";
			Элементы.Заявитель.Доступность 		= Ложь;
			Элементы.Заявитель.Видимость 			= Ложь;
			
		Иначе
			
			Элементы.ОбъектУчета.Заголовок = "Лицевой счет";
			Элементы.Заявитель.Доступность = Истина;
			Элементы.Заявитель.Видимость   = Истина;
			
		КонецЕсли; 
		
	Иначе
		
		Элементы.ОбъектУчета.Заголовок 		= "";
		Элементы.ОбъектУчета.Доступность	= Ложь;
		Элементы.Заявитель.Доступность 		= Ложь;
		Элементы.Заявитель.Видимость 		= Ложь;
		
	КонецЕсли;
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ДолгПоЛС = ДокументОбъект.ВывестиСуммуДолгаПоЛС();
	
	Элементы.ДолгПоТекущемуЛС.Заголовок  = ДолгПоЛС.СтрокаДолга;
	Элементы.ДолгПоТекущемуЛС.ЦветТекста = ДолгПоЛС.ЦветНадписи;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	// Вызов механизма разделения прав доступа.
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ,СтандартнаяОбработка,ДокументОбъект,ЭтаФорма);
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	УправлениеЭлементамиФормы();
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм

&НаКлиенте
Процедура ВыписатьРеализацию(Команда)
	
	Если (Объект.ПометкаУдаления) И Не ЗначениеЗаполнено(Объект.РеализацияТоваровУслуг) Тогда
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ВыписатьРеализациюЗавершение3", ЭтотОбъект), "Реализацию товаров и услуг нельзя вводить на основании документа, помеченного на удаление.");
		
		Возврат;
		
	КонецЕсли;
	
	Если (НЕ ЗначениеЗаполнено(Объект.РеализацияТоваровУслуг)) Тогда
		
		// Вводим новый документ на основании нашего.
		Если ЭтаФорма.Модифицированность Тогда
			
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ВыписатьРеализациюЗавершение2", ЭтотОбъект), "Документ был изменен. Сначала следует записать документ.");
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если (НЕ ЗначениеЗаполнено(Объект.РеализацияТоваровУслуг)) Тогда
		
		ВыписатьРеализациюНаСервере();
		
		ПоказатьЗначение(Новый ОписаниеОповещения("ВыписатьРеализациюЗавершение1", ЭтотОбъект), Объект.РеализацияТоваровУслуг);
		Возврат;
		
	Иначе
		
		ПоказатьЗначение(Новый ОписаниеОповещения("ВыписатьРеализациюЗавершение", ЭтотОбъект), Объект.РеализацияТоваровУслуг);
		Возврат;
		
	КонецЕсли;
	
	ВыписатьРеализациюФрагмент1();
КонецПроцедуры

&НаКлиенте
Процедура ВыписатьРеализациюЗавершение3(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыписатьРеализациюЗавершение2(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыписатьРеализациюЗавершение1(ДополнительныеПараметры) Экспорт
	
	// Откроем форму для редактирования.
	ВыписатьРеализациюФрагмент1();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыписатьРеализациюФрагмент1()
	
	ВыписатьРеализациюФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыписатьРеализациюЗавершение(ДополнительныеПараметры) Экспорт
	
	ВыписатьРеализациюФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыписатьРеализациюФрагмент()
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыписатьСписание(Команда)
	
	Если (Объект.ПометкаУдаления) И Не ЗначениеЗаполнено(Объект.ТребованиеНакладная) Тогда
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ВыписатьСписаниеЗавершение3", ЭтотОбъект), "Требование-накладную нельзя вводить на основании документа, помеченного на удаление");
		
		Возврат;
		
	КонецЕсли;
	
	Если (НЕ ЗначениеЗаполнено(Объект.ТребованиеНакладная)) Тогда
		
		// Вводим новый документ на основании нашего.
		Если ЭтаФорма.Модифицированность Тогда
			
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ВыписатьСписаниеЗавершение2", ЭтотОбъект), "Документ был изменен. Сначала следует записать документ.");
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если (НЕ ЗначениеЗаполнено(Объект.ТребованиеНакладная)) Тогда
		
		ВыписатьСписаниеНаСервере();
		
		ПоказатьЗначение(Новый ОписаниеОповещения("ВыписатьСписаниеЗавершение1", ЭтотОбъект), Объект.ТребованиеНакладная);
		Возврат;
		
	Иначе
		
		ПоказатьЗначение(Новый ОписаниеОповещения("ВыписатьСписаниеЗавершение", ЭтотОбъект), Объект.ТребованиеНакладная);
		Возврат;
		
	КонецЕсли;
	
	ВыписатьСписаниеФрагмент1();
КонецПроцедуры

&НаКлиенте
Процедура ВыписатьСписаниеЗавершение3(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыписатьСписаниеЗавершение2(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыписатьСписаниеЗавершение1(ДополнительныеПараметры) Экспорт
	
	ВыписатьСписаниеФрагмент1();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыписатьСписаниеФрагмент1()
	
	ВыписатьСписаниеФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыписатьСписаниеЗавершение(ДополнительныеПараметры) Экспорт
	
	// Откроем форму для редактирования Требования-накладной.
	ВыписатьСписаниеФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыписатьСписаниеФрагмент()
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФактПоПлану(Команда)
	
	Для каждого ТекСтрока Из Объект.Работы Цикл
		
		ТекСтрока.Объем 	  = ТекСтрока.ОбъемПлан;
		ТекСтрока.Количество  = ТекСтрока.КоличествоПлан;
		ТекСтрока.СуммаРаботы = ТекСтрока.СуммаПлан;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.НарядЗаказ.Количество() > 0 Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), "Табличная часть """"Наряд-Заказ"""" содержит строки! Очистить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.НарядЗаказ.Очистить();
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФрагмент()
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Объект.Работы.Количество() <> 0 ИЛИ Объект.НарядЗаказ.Количество() <> 0 ИЛИ ЗначениеЗаполнено(Объект.ОбъектУчета) Тогда
		
		Объект.Работы.Очистить();
		Объект.НарядЗаказ.Очистить();
		
		Если ЗначениеЗаполнено(Объект.ВидОбъекта) Тогда
			
			Если Объект.ВидОбъекта = ПолучитьВидОбъектовУчетаЗдание() Тогда
				
				Объект.ОбъектУчета = ПолучитьПустойСписокЗданий();
				
			Иначе
				
				Объект.ОбъектУчета = ПолучитьПустойЛицевойСчет();
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Если Объект.Работы.Количество() <> 0 ИЛИ Объект.НарядЗаказ.Количество() <> 0 Тогда
		
		Объект.Работы.Очистить();
		Объект.НарядЗаказ.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаПриИзменении(Элемент)
	
	Если Объект.Работы.Количество() <> 0 ИЛИ Объект.НарядЗаказ.Количество() <> 0 Тогда
		
		Объект.Работы.Очистить();
		Объект.НарядЗаказ.Очистить();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВидОбъекта) Тогда
		
		Если Объект.ВидОбъекта = ПолучитьВидОбъектовУчетаЗдание() Тогда
			
			Если ТипЗнч(ПолучитьПустойСписокЗданий()) <> ТипЗнч(Объект.ОбъектУчета) Тогда
				
				Объект.ОбъектУчета = ПолучитьПустойСписокЗданий();
				
			КонецЕсли;
			
		Иначе
			
			Если ТипЗнч(ПолучитьПустойЛицевойСчет()) <> ТипЗнч(Объект.ОбъектУчета) Тогда
				
				Объект.ОбъектУчета = ПолучитьПустойЛицевойСчет();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектУчетаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОбъектУчета) Тогда
		
		Если Объект.ВидОбъекта = ПолучитьВидОбъектовУчетаЗдание() Тогда
			
			Объект.Адрес =
			Строка(ПолучитьУлицуОбъектаУчета(Объект.ОбъектУчета))
			+ ", д." + Объект.ОбъектУчета + 
			?(ПустаяСтрока(ПолучитьКорпусОбъектаУчета(Объект.ОбъектУчета)),
			"",
			", кор. " + ПолучитьКорпусОбъектаУчета(Объект.ОбъектУчета));
			
		Иначе
			
			Объект.Адрес = Строка(ПолучитьУлицуЛицевогоСчетаОбъектаУчета(Объект.ОбъектУчета)) + ", д. " + Строка(ПолучитьЗданиеОбъектаУчета(Объект.ОбъектУчета)) + 
			?(ПустаяСтрока(ПолучитьКорпусЗданияОбъектаУчета(Объект.ОбъектУчета)),
			"",
			", кор. " + ПолучитьКорпусЗданияОбъектаУчета(Объект.ОбъектУчета) + ", кв. " + Строка(ПолучитьКвартируОбъектаУчета(Объект.ОбъектУчета)));
			
			ВывестиСуммуДолгаПоЛСНаСервере();
			
		КонецЕсли;
		
	Иначе
		
		Объект.Адрес              = "";
		Элементы.ДолгПоТекущемуЛС = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Организация",Объект.Организация);
		
		Если Объект.ВидОбъекта = ПолучитьВидОбъектовУчетаЗдание() Тогда
			
			ФормаВыбора = "Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая";
			
		Иначе
			
			ФормаВыбора = "Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая";
			
		КонецЕсли;
		
		ОткрытьФорму(ФормаВыбора, Новый Структура("Отбор", Отбор), Элемент);
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Заполните поле Организация.";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.Заявитель) = Тип("СправочникСсылка.бит_Проживающие") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = ПолучитьСписокПроживающих(Объект.ОбъектУчета, Объект.Дата);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыРаботаПриИзменении(Элемент)
	
	ТекущаяСтрока	 = Элементы.Работы.ТекущиеДанные;
	Норма			 = ТекущаяСтрока.Норма;
	ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Работа) Тогда
		
		Владелец = ВладелецНаСервере(Норма);	
		
		Если Норма.Владелец <> ТекущаяСтрока.Работа Тогда
			
			ТекущаяСтрока.Норма = ПолучитьПустуюНормуТруда();	
			ТекущаяСтрока.ЕдиницаИзмерения = ПолучитьПустойКлассификаторЕдиницИзмерения();
			
		КонецЕсли;  
		
	КонецЕсли;  
	
	Коэффициент = ПолучитьОбъемРаботы(ТекущаяДата(), Объект.Подразделение, Объект.ВидОбъекта, ТекущаяСтрока.Работа, ТекущаяСтрока.ЕдиницаИзмерения, ТекущаяСтрока.Норма);
	
	Если Коэффициент <> 0 Тогда
		
		ТекущаяСтрока.КоэффициентНормы = Коэффициент;
		ТекущаяСтрока.ОбъемПлан 	   = Коэффициент;
		ТекущаяСтрока.КоличествоПлан   = 1;
		
	Иначе
		
		ТекущаяСтрока.ОбъемПлан 	   = 0;
		ТекущаяСтрока.КоэффициентНормы = 0;
		
	КонецЕсли; 
	
	ЦенаРаботы = ПолучитьЦенуРаботы(ТекущаяДата(), Объект.ВалютаДокумента, Объект.Подразделение, Объект.ВидОбъекта, ТекущаяСтрока.Работа, ТекущаяСтрока.ЕдиницаИзмерения, ТекущаяСтрока.Норма);
	
	ТекущаяСтрока.ЦенаРаботы = ЦенаРаботы;
	
	РассчитатьСтрокуТабЧастиРаботы(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Функция ВладелецНаСервере(Норма)
	
	Возврат Норма.Владелец;
	
КонецФункции

&НаКлиенте
Процедура РаботыЕдиницаИзмеренияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
	Норма 		  = ТекущаяСтрока.Норма;
	
	ЕдиницаИзмерения = ЕдиницаИзмеренияНаСервере(Норма);
	
	Если ЗначениеЗаполнено(Норма) Тогда
		
		Если ТекущаяСтрока.ЕдиницаИзмерения <> ЕдиницаИзмерения Тогда
			
			ТекущаяСтрока.Норма = ПолучитьПустуюНормуТруда();	
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Коэффициент = ПолучитьОбъемРаботы(ТекущаяДата(), Объект.Подразделение, Объект.ВидОбъекта, ТекущаяСтрока.Работа, ТекущаяСтрока.ЕдиницаИзмерения, ТекущаяСтрока.Норма);
	
	Если Коэффициент <> 0 Тогда
		
		ТекущаяСтрока.КоэффициентНормы = Коэффициент;
		ТекущаяСтрока.ОбъемПлан 	   = Коэффициент;
		ТекущаяСтрока.КоличествоПлан   = 1;
		
	Иначе
		
		ТекущаяСтрока.ОбъемПлан 	   = 0;
		ТекущаяСтрока.КоэффициентНормы = 0;
		
	КонецЕсли; 
	
	ЦенаРаботы = ПолучитьЦенуРаботы(ТекущаяДата(), Объект.ВалютаДокумента, Объект.Подразделение, Объект.ВидОбъекта, ТекущаяСтрока.Работа, ТекущаяСтрока.ЕдиницаИзмерения, ТекущаяСтрока.Норма);
	
	ТекущаяСтрока.ЦенаРаботы = ЦенаРаботы;
	
	РассчитатьСтрокуТабЧастиРаботы(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Функция ЕдиницаИзмеренияНаСервере(Норма)
	
	Возврат Норма.ЕдиницаИзмерения;
	
КонецФункции

&НаКлиенте
Процедура РаботыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мСписокЕдиницИзмерения.Очистить();
	
	ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
	Работа 		  = ТекущаяСтрока.Работа;
	
	Если ЗначениеЗаполнено(Работа) Тогда
		
		мСписокЕдиницИзмерения = ЕдиницыИзмеренияНаСервере(Работа);	
		
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Ссылка", мСписокЕдиницИзмерения);
		
		ОткрытьФорму("Документ.бит_ЗаявкаНаВыполнениеРабот.Форма.ФормаВыбораСправочникаКлассификаторЕдиницИзмерения", Новый Структура("Отбор", Отбор), Элемент);
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Заполните поле Работа.";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕдиницыИзмеренияНаСервере(Работа)
	
	Для Каждого ТекСтрока Из Работа.ЕдиницыИзмерения Цикл
		
		мСписокЕдиницИзмерения.Добавить(ТекСтрока.ЕдиницаИзмерения);
		
	КонецЦикла;
	
	Возврат мСписокЕдиницИзмерения;	
	
КонецФункции

&НаКлиенте
Процедура РаботыНормаПриИзменении(Элемент)
	
	ТекущаяСтрока	 = Элементы.Работы.ТекущиеДанные;                           	
	
	Коэффициент = ПолучитьОбъемРаботы(ТекущаяДата(), Объект.Подразделение, Объект.ВидОбъекта, ТекущаяСтрока.Работа, ТекущаяСтрока.ЕдиницаИзмерения, ТекущаяСтрока.Норма);
	
	Если Коэффициент <> 0 Тогда
		
		ТекущаяСтрока.КоэффициентНормы = Коэффициент;
		ТекущаяСтрока.ОбъемПлан 	   = Коэффициент;
		ТекущаяСтрока.КоличествоПлан   = 1;
		
	Иначе
		
		ТекущаяСтрока.ОбъемПлан 	   = 0;
		ТекущаяСтрока.КоэффициентНормы = 0;
		
	КонецЕсли; 
	
	ЦенаРаботы = ПолучитьЦенуРаботы(ТекущаяДата(), Объект.ВалютаДокумента, Объект.Подразделение, Объект.ВидОбъекта, ТекущаяСтрока.Работа, ТекущаяСтрока.ЕдиницаИзмерения, ТекущаяСтрока.Норма);
	
	ТекущаяСтрока.ЦенаРаботы = ЦенаРаботы;
	
	РассчитатьСтрокуТабЧастиРаботы(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыНормаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
	Работа 		  = ТекущаяСтрока.Работа;
	
	Если ЗначениеЗаполнено(Работа) Тогда
		
		ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Владелец", Работа);
		
		Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
			
			Отбор.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);			
			
			ОткрытьФорму("Справочник.бит_НормыТруда.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
			
		Иначе	
			
			ОткрытьФорму("Справочник.бит_НормыТруда.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
			
		КонецЕсли; 
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Заполните поле Работа.";
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыОбъемПриИзменении(Элемент)
	
	ТекущаяСтрока	 = Элементы.Работы.ТекущиеДанные;
	
	Если ТекущаяСтрока.КоэффициентНормы <> 0 Тогда
		
		ТекущаяСтрока.Количество = ТекущаяСтрока.Объем /ТекущаяСтрока.КоэффициентНормы;
		
	Иначе
		
		ТекущаяСтрока.Количество = 0;
		
	КонецЕсли; 
	
	РассчитатьСтрокуТабЧастиРаботы(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыОбъемПланПриИзменении(Элемент)
	
	ТекущаяСтрока	 = Элементы.Работы.ТекущиеДанные;
	
	Если ТекущаяСтрока.КоэффициентНормы <> 0 Тогда
		
		ТекущаяСтрока.КоличествоПлан = ТекущаяСтрока.ОбъемПлан / ТекущаяСтрока.КоэффициентНормы; 
		
	Иначе
		
		ТекущаяСтрока.КоличествоПлан = 0;
		
	КонецЕсли; 
	
	РассчитатьСтрокуТабЧастиРаботы(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыКоличествоПланПриИзменении(Элемент)
	
	ТекущаяСтрока	 = Элементы.Работы.ТекущиеДанные;
	
	ТекущаяСтрока.ОбъемПлан = ТекущаяСтрока.КоличествоПлан * ТекущаяСтрока.КоэффициентНормы;
	
	РассчитатьСтрокуТабЧастиРаботы(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
	
	ТекущаяСтрока.Объем = ТекущаяСтрока.Количество * ТекущаяСтрока.КоэффициентНормы;
	
	РассчитатьСтрокуТабЧастиРаботы(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура НарядЗаказКоличествоПланПриИзменении(Элемент)
	
	ТекСтрокаТабЧасти = Элементы.НарядЗаказ.ТекущиеДанные;
	
	РассчитатьСтрокуТабЧастиНарядЗаказ(ТекСтрокаТабЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура НарядЗаказКоличествоПриИзменении(Элемент)
	
	ТекСтрокаТабЧасти = Элементы.НарядЗаказ.ТекущиеДанные;
	
	РассчитатьСтрокуТабЧастиНарядЗаказ(ТекСтрокаТабЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура НарядЗаказЦенаПриИзменении(Элемент)
	
	ТекСтрокаТабЧасти = Элементы.НарядЗаказ.ТекущиеДанные;
	
	РассчитатьСтрокуТабЧастиНарядЗаказ(ТекСтрокаТабЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура НарядЗаказСтавкаНДСПриИзменении(Элемент)
	
	ТекСтрокаТабЧасти = Элементы.НарядЗаказ.ТекущиеДанные;
	
	РассчитатьСтрокуТабЧастиНарядЗаказ(ТекСтрокаТабЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура НарядЗаказСуммаПриИзменении(Элемент)
	
	ТекСтрокаТабЧасти = Элементы.НарядЗаказ.ТекущиеДанные;
	
	РассчитатьСтрокуТабЧастиНарядЗаказ(ТекСтрокаТабЧасти);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьКвартируОбъектаУчета(ОбъектУчета)
	
	Возврат ОбъектУчета.Квартира;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКорпусЗданияОбъектаУчета(ОбъектУчета)
	
	Возврат ОбъектУчета.Здание.Корпус;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗданиеОбъектаУчета(ОбъектУчета)
	
	Возврат ОбъектУчета.Здание;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьУлицуЛицевогоСчетаОбъектаУчета(ОбъектУчета)
	
	Возврат ОбъектУчета.УлицаЛицевогоСчета;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКорпусОбъектаУчета(ОбъектУчета)
	
	Возврат ОбъектУчета.Корпус;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьУлицуОбъектаУчета(ОбъектУчета)
	
	Возврат ОбъектУчета.Улица;
	
КонецФункции

&НаСервереБезКонтекста
// Параметры:
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьСписокПроживающих(Знач ЛицевойСчет, Знач Дата)
	
	Результат = Новый СписокЗначений;
	
	Запрос =  Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Момент"     ,КонецДня(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ТаблицаФизЛиц = РезультатЗапроса.Выгрузить();
	
	Результат.ЗагрузитьЗначения(ТаблицаФизЛиц.ВыгрузитьКолонку("ФизЛицо"));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ВывестиСуммуДолгаПоЛСНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ДолгПоЛС = ДокументОбъект.ВывестиСуммуДолгаПоЛС();
	
	Элементы.ДолгПоТекущемуЛС.Заголовок  = ДолгПоЛС.СтрокаДолга;
	Элементы.ДолгПоТекущемуЛС.ЦветТекста = ДолгПоЛС.ЦветНадписи;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	СпРабот			  = Новый СписокЗначений;
	СпЕдиницИзмерений = Новый СписокЗначений;
	
	Для каждого ТекСтрока Из Объект.Работы Цикл
		
		СпРабот.Добавить(ТекСтрока.Работа);
		СпЕдиницИзмерений.Добавить(ТекСтрока.ЕдиницаИзмерения);
		
	КонецЦикла;
	
	ТЗНаборРаботаЕдИзм = Объект.Работы.Выгрузить(,"Работа, ЕдиницаИзмерения, Объем, ОбъемПлан");
	ТЗНаборРаботаЕдИзм.Свернуть("Работа, ЕдиницаИзмерения","Объем, ОбъемПлан");
	
	ВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ВТ;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗНаборРаботаЕдИзм.Работа,
	|	ТЗНаборРаботаЕдИзм.ЕдиницаИзмерения,
	|	ТЗНаборРаботаЕдИзм.Объем,
	|	ТЗНаборРаботаЕдИзм.ОбъемПлан
	|ПОМЕСТИТЬ НаборРаботаЕдИзм
	|ИЗ
	|	&ТЗНаборРаботаЕдИзм КАК ТЗНаборРаботаЕдИзм";
	
	Запрос.УстановитьПараметр("ТЗНаборРаботаЕдИзм", ТЗНаборРаботаЕдИзм);
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаборРаботаЕдИзм.Работа КАК Работа,
	|	ЕСТЬNULL(бит_СоставРаботСрезПоследних.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(бит_СоставРаботСрезПоследних.Коэффициент, 0)) КАК Коэффициент,
	|	СУММА(ЕСТЬNULL(бит_СоставРаботСрезПоследних.Количество, 0)) КАК Количество,
	|	СУММА(НаборРаботаЕдИзм.Объем) КАК Объем,
	|	СУММА(НаборРаботаЕдИзм.ОбъемПлан) КАК ОбъемПлан
	|ИЗ
	|	РегистрСведений.бит_СоставРабот.СрезПоследних(
	|			&Период,
	|			ВидОбъекта = &ВидОбъекта
	|				И Подразделение = &Подразделение
	|				И Работа В (&СпРабот)
	|				И ЕдиницаИзмерения В (&СпЕдиницИзмерений)) КАК бит_СоставРаботСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборРаботаЕдИзм КАК НаборРаботаЕдИзм
	|		ПО бит_СоставРаботСрезПоследних.Работа = НаборРаботаЕдИзм.Работа
	|			И бит_СоставРаботСрезПоследних.ЕдиницаИзмерения = НаборРаботаЕдИзм.ЕдиницаИзмерения
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборРаботаЕдИзм.Работа,
	|	ЕСТЬNULL(бит_СоставРаботСрезПоследних.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Работа,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("Период"		     , ТекущаяДата());
	Запрос.УстановитьПараметр("Подразделение"	 , Объект.Подразделение);
	Запрос.УстановитьПараметр("ВидОбъекта" 		 , Объект.ВидОбъекта);
	Запрос.УстановитьПараметр("СпРабот"			 , СпРабот);
	Запрос.УстановитьПараметр("СпЕдиницИзмерений", СпЕдиницИзмерений);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока  Выборка.Следующий() Цикл
		НоваяСтрока = Объект.НарядЗаказ.Добавить();
		НоваяСтрока.Работа 			 = Выборка.Работа;
		НоваяСтрока.Номенклатура	 = Выборка.Номенклатура;
		НоваяСтрока.ЕдиницаИзмерения = Выборка.Номенклатура.ЕдиницаИзмерения;
		//19.12.2018 55
		НоваяСтрока.СтавкаНДС		 = Выборка.Номенклатура.ВидСтавкиНДС;
		НоваяСтрока.Количество	     = ?(Выборка.Коэффициент <> 0, Выборка.Объем/Выборка.Коэффициент*Выборка.Количество,
		Выборка.Объем*Выборка.Количество);
		НоваяСтрока.КоличествоПлан	 = ?(Выборка.Коэффициент <> 0, Выборка.ОбъемПлан/Выборка.Коэффициент*Выборка.Количество,
		Выборка.ОбъемПлан*Выборка.Количество);
	КонецЦикла;
	
	СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЗакупочнымЦенам;
	
	Для Каждого ТекСтрока Из Объект.НарядЗаказ Цикл
		
		ТекСтрока.СуммаПлан = ?(Не ТекСтрока.Количество = 0, (ТекСтрока.Сумма / ТекСтрока.Количество), 0) * ТекСтрока.КоличествоПлан;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыписатьСписаниеНаСервере()
	
	
	ОбъектТН = Документы.ТребованиеНакладная.СоздатьДокумент();
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	// Заполнение шапки.
	ОбъектТН.Комментарий   = "Введен на основании документа " + Строка(ДокументОбъект);
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ОбъектТН, бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"),,,);
	
	ОбъектТН.Организация   = Объект.Организация;
	ОбъектТН.Ответственный = Объект.Ответственный;
	
	Для Каждого ТекСтрокаМатериалыЗаказчика Из Объект.НарядЗаказ Цикл
		
		НоваяСтрока              = ОбъектТН.Материалы.Добавить();
		НоваяСтрока.Количество   = ТекСтрокаМатериалыЗаказчика.Количество;
		НоваяСтрока.Номенклатура = ТекСтрокаМатериалыЗаказчика.Номенклатура;
		
		СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ОбъектТН.Организация, НоваяСтрока.Номенклатура, ОбъектТН.Склад);
		
		НоваяСтрока.Счет         = СчетаУчета.СчетУчета;
		
	КонецЦикла;
	
	ОбъектТН.Дата = ТекущаяДата();
	ОбъектТН.Записать(РежимЗаписиДокумента.Запись);
	
	Объект.ТребованиеНакладная = ОбъектТН.Ссылка;
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ВыписатьРеализациюНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	ТекПользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	ОбъектРТУ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();//ПолучитьФормуНовогоДокумента(, ЭтаФорма, Строка(Объект));
	
	// Заполнение шапки.
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ОбъектРТУ, ТекПользователь,,,);
	
	ОбъектРТУ.ВидОперации             = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
	ОбъектРТУ.Организация             = Объект.Организация;		
	ОбъектРТУ.ВалютаДокумента         = Объект.ВалютаДокумента;
	ОбъектРТУ.КурсВзаиморасчетов      = 1;
	ОбъектРТУ.КратностьВзаиморасчетов = 1;		
	
	ОбъектРТУ.СуммаВключаетНДС        = Объект.СуммаВключаетНДС;	
	ОбъектРТУ.Комментарий             = "Введен на основании документа "+Строка(ДокументОбъект);
	
	УчетДенежныхСредствБП.УстановитьБанковскийСчет(ОбъектРТУ.БанковскийСчетОрганизации, ОбъектРТУ.Организация, ОбъектРТУ.ВалютаДокумента);

	Если ЗначениеЗаполнено(ОбъектРТУ.Организация)
		И ЗначениеЗаполнено(ОбъектРТУ.Контрагент)
		И ЗначениеЗаполнено(ОбъектРТУ.ДоговорКонтрагента) Тогда
		Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаРасчетов(ОбъектРТУ);
	КонецЕсли;
	
	// Табличная часть документа.
	Для Каждого ТекСтрока Из Объект.НарядЗаказ Цикл
		
		Если ТекСтрока.Номенклатура.Услуга = Истина Тогда
			
			НоваяСтрока = ОбъектРТУ.Услуги.Добавить();
			
			НаименованиеПолное = ТекСтрока.Номенклатура.НаименованиеПолное;
			
			Если ПустаяСтрока(НаименованиеПолное) Тогда
				
				НоваяСтрока.Содержание = ТекСтрока.Номенклатура.Наименование;
				
			Иначе
				
				НоваяСтрока.Содержание = НаименованиеПолное;
				
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока                  = ОбъектРТУ.Товары.Добавить();
			
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
			
		КонецЕсли;
		
		НоваяСтрока.Номенклатура         = ТекСтрока.Номенклатура;
		НоваяСтрока.СтавкаНДС            = ТекСтрока.СтавкаНДС;
		НоваяСтрока.Количество           = ТекСтрока.Количество;
		НоваяСтрока.Цена                 = ТекСтрока.Цена;
		НоваяСтрока.Сумма                = ТекСтрока.Сумма;
		
		НоваяСтрока.СуммаНДС             = УчетНДСКлиентСервер.РассчитатьСуммуНДС(НоваяСтрока.Сумма,Объект.СуммаВключаетНДС, 
		УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
		
		Если НЕ НоваяСтрока.Номенклатура.Услуга = Истина Тогда
			
			СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ОбъектРТУ.Организация, НоваяСтрока.Номенклатура, ОбъектРТУ.Склад);
			
			НоваяСтрока.СчетУчета = СчетаУчета.СчетУчета;
			
		КонецЕсли;
		
		СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ОбъектРТУ.Организация, НоваяСтрока.Номенклатура);
		
		НоваяСтрока.СчетДоходов  = СчетаУчета.СчетДоходов;
		НоваяСтрока.СчетРасходов = СчетаУчета.СчетРасходов;
		НоваяСтрока.СчетУчетаНДСПоРеализации = СчетаУчета.СчетУчетаНДСпродажи;
		
		Если Не НоваяСтрока.СчетДоходов.Пустая() Тогда
			
			НоваяСтрока.Субконто = Новый(НоваяСтрока.СчетДоходов.ВидыСубконто[0].ВидСубконто.ТипЗначения.Типы()[0]);
			
			Если ТипЗнч(НоваяСтрока.Субконто) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
				
				НоваяСтрока.Субконто = НоваяСтрока.Номенклатура.НоменклатурнаяГруппа;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбъектРТУ.Дата = ТекущаяДата();
	ОбъектРТУ.Записать(РежимЗаписиДокумента.Запись);
	
	Объект.РеализацияТоваровУслуг = ОбъектРТУ.Ссылка;
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПустойКлассификаторЕдиницИзмерения()
	
	Возврат Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	
КонецФункции

&НаСервере
Функция ПолучитьПустуюНормуТруда()
	
	Возврат Справочники.бит_НормыТруда.ПустаяСсылка();
	
КонецФункции

&НаСервере
Функция ПолучитьВидОбъектовУчетаЗдание()
	
	Возврат Перечисления.бит_ВидыОбъектовУчета.Здание;
	
КонецФункции

&НаСервере
Функция ПолучитьПустойЛицевойСчет()
	
	Возврат Справочники.бит_ЛицевыеСчета.ПустаяСсылка();
	
КонецФункции

&НаСервере
Функция ПолучитьПустойСписокЗданий()
	
	Возврат Справочники.бит_СписокЗданий.ПустаяСсылка();
	
КонецФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Организация"         , Объект.Организация);
	
КонецПроцедуры

&НаСервере
Функция НарядЗаказНаСервере()
	
	ТабДок = ПечатьНарядЗаказ("НарядЗаказ");	
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура НарядЗаказ(Команда)
	Результат = НарядЗаказНаСервере();
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЗаявкаНаВыполнениеРабот"
	,"НарядЗаказ"
	,"Наряд заказ"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

// Функция формирует табличный документ заявки.
&НаСервере
Функция ПечатьНарядЗаказ(ИмяМакета)
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.бит_ЗаявкаНаВыполнениеРабот"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ЗаявкаНаВыполнениеРабот.Номер,
	|	бит_ЗаявкаНаВыполнениеРабот.Дата,
	|	бит_ЗаявкаНаВыполнениеРабот.Организация,
	|	бит_ЗаявкаНаВыполнениеРабот.ВидОбъекта,
	|	бит_ЗаявкаНаВыполнениеРабот.ОбъектУчета,
	|	бит_ЗаявкаНаВыполнениеРабот.ТекстЗаявки,
	|	бит_ЗаявкаНаВыполнениеРабот.Телефон,
	|	бит_ЗаявкаНаВыполнениеРабот.ОтветственныйЗаВыполнение,
	|	бит_ЗаявкаНаВыполнениеРабот.Ответственный,
	|	бит_ЗаявкаНаВыполнениеРабот.Адрес
	|ИЗ
	|	Документ.бит_ЗаявкаНаВыполнениеРабот КАК бит_ЗаявкаНаВыполнениеРабот
	|ГДЕ
	|	бит_ЗаявкаНаВыполнениеРабот.Ссылка = &ТекущийДокумент";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Работы.Работа
	|ИЗ
	|	Документ.бит_ЗаявкаНаВыполнениеРабот.Работы КАК Работы
	|ГДЕ
	|	Работы.Ссылка = &ТекущийДокумент";
	
	ЗапросПоРаботам = Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НарядЗаказ.Номенклатура.Код КАК Код,
	|	НарядЗаказ.Номенклатура КАК Материал,
	|	НарядЗаказ.ЕдиницаИзмерения КАК ЕдИзм,
	|	НарядЗаказ.КоличествоПлан КАК КолвоПлан,
	|	НарядЗаказ.Количество КАК КолвоФакт,
	|	НарядЗаказ.Цена КАК Цена,
	|	НарядЗаказ.СуммаПлан КАК СуммаПлан,
	|	НарядЗаказ.Сумма КАК СуммаФакт
	|ИЗ
	|	Документ.бит_ЗаявкаНаВыполнениеРабот.НарядЗаказ КАК НарядЗаказ
	|ГДЕ
	|	НарядЗаказ.Ссылка = &ТекущийДокумент";
	
	ЗапросПоНоменклатуре = Запрос.Выполнить();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НарядЗаказ";
	
	// Вывод заголовка.
	Макет = ДокументОбъект.ПолучитьМакет(ИмяМакета);
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	
	ОблШапка.Параметры.ДатаДокумента  = ВРег(Формат(Шапка.Дата, "ДЛФ=Д"));
	ОблШапка.Параметры.Организация    = Шапка.Организация;
	
	Если Объект.ВидОбъекта = Перечисления.бит_ВидыОбъектовУчета.ЛицевойСчет Тогда
		ОблШапка.Параметры.Заказчик   = Строка(Шапка.ОбъектУчета) + ", " + Шапка.Адрес + ", " + Шапка.Телефон;
	Иначе
		ОблШапка.Параметры.Заказчик   = Строка(Шапка.ОбъектУчета);
	КонецЕсли;
	
	ОблШапка.Параметры.ТекстЗаявки    = СтрЗаменить(Шапка.ТекстЗаявки, Символы.ПС, " ");
	ОблШапка.Параметры.Ответственный  = Шапка.Ответственный;
	ОблШапка.Параметры.ОтветственныйЗаВыполнение = Шапка.ОтветственныйЗаВыполнение;
	
	ТабДокумент.Вывести(ОблШапка);
	
	ВыборкаПоРаботам = ЗапросПоРаботам.Выгрузить();
	ВыборкаПоРаботам.Свернуть("Работа");
	
	Для Каждого СтрокаТЧ Из ВыборкаПоРаботам Цикл
		
		Область = Макет.ПолучитьОбласть("Работа");
		Область.Параметры.Заполнить(СтрокаТЧ);
		ТабДокумент.Вывести(Область);
		
	КонецЦикла;
	
	// Вывод шапки таблицы.
	ОблШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОблШапкаТаблицы);
	
	ВыборкаПоСтрокам = ЗапросПоНоменклатуре.Выгрузить();
	ВыборкаПоСтрокам.Свернуть("Материал, Код, ЕдИзм, Цена", "КолвоПлан,КолвоФакт, СуммаПлан, СуммаФакт");
	ИтогоСуммаПлан = 0;
	ИтогоСуммаФакт = 0;
	
	Для Каждого СтрокаТЧ Из ВыборкаПоСтрокам Цикл
		
		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(СтрокаТЧ);
		ТабДокумент.Вывести(Область);
		ИтогоСуммаПлан = ИтогоСуммаПлан + СтрокаТЧ.СуммаПлан;
		ИтогоСуммаФакт = ИтогоСуммаФакт + СтрокаТЧ.СуммаФакт;
		
	КонецЦикла;
	
	// Вывод итогов.
	ОблИтогТаблицы = Макет.ПолучитьОбласть("Итог");
	ОблИтогТаблицы.Параметры.ИтогоСуммаПлан = ИтогоСуммаПлан;
	ОблИтогТаблицы.Параметры.ИтогоСуммаФакт = ИтогоСуммаФакт;
	ТабДокумент.Вывести(ОблИтогТаблицы);
	
	// Вывод подвала.
	Область = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(Область);
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции


#КонецОбласти
